app/Controllers/AdminController.php

    public function orders_transactions() {
        $orderModel = new OrderModel();
        $gearModel = new Gear_Product_Model();
        $placedOrdersModel = new Placed_Orders_Model();
        $adminAccountModel = new Admin_Account_Model();

        $orders = $orderModel->select('orders.*, products.product_name, products.image_url')
                             ->join('products', 'orders.product_id = products.product_id')
                             ->orderBy('orders.created_at', 'DESC')
                             ->findAll();

        $confirmOrder = $orderModel->select('orders.*, products.product_name, products.image_url')
                                   ->join('products', 'orders.product_id = products.product_id')
                                   ->where('order_status', 'confirmed')
                                   ->orderBy('orders.created_at', 'DESC')
                                   ->findAll();

        $completedOrders = $orderModel->select('orders.*, products.product_name, products.image_url')
                                      ->join('products', 'orders.product_id = products.product_id')
                                      ->where('order_status', 'completed')
                                      ->orderBy('orders.date_completed', 'DESC')
                                      ->findAll();

        $cancelledOrders = $orderModel->select('orders.*, products.product_name, products.image_url')
                                      ->join('products', 'orders.product_id = products.product_id')
                                      ->where('order_status', 'cancelled')
                                      ->orderBy('orders.date_cancelled', 'DESC')
                                      ->findAll();

        $data = [
            'adminAccount'     => $adminAccountModel->getUser('admin_account_id', session()->get('admin_id')),
            'cancelledOrders'  => $cancelledOrders,
            'orders'           => $orders,
            'complete'         => $completedOrders,
            'totalOrders'      => $orderModel->getTotalOrders(),
            'totalPlaced'      => $placedOrdersModel->getTotalPlaced()->totalPlacedOrders ?? 0,
            'totalCancelled'   => $orderModel->getTotalCancelled(),
            'totalComplete'    => $orderModel->getTotalComplete(),
            'totalRevenue'     => $orderModel->getTotalRevenue(),
            'confirmOrder'     => $confirmOrder
        ];
---
SELECT `orders`.*, `products`.`product_name`, `products`.`image_url`
FROM `orders`
JOIN `products` ON `orders`.`product_id` = `products`.`product_id`
ORDER BY `orders`.`created_at` DESC
SELECT `orders`.*, `products`.`product_name`, `products`.`image_url`
FROM `orders`
JOIN `products` ON `orders`.`product_id` = `products`.`product_id`
WHERE `order_status` = 'confirmed'
ORDER BY `orders`.`created_at` DESC
SELECT `orders`.*, `products`.`product_name`, `products`.`image_url`
FROM `orders`
JOIN `products` ON `orders`.`product_id` = `products`.`product_id`
WHERE `order_status` = 'cancelled'
ORDER BY `orders`.`date_cancelled` DESC