app/Controllers/HomeController.php

    public function community()
    {
        $postModel = new PostModel();
        $commentModel = new CommentModel();

        $posts = $postModel->findAll();
---
SELECT *
FROM `posts`