app/Controllers/IEMCustomizationController.php

SELECT *
FROM `iem_customizations`
WHERE `user_id` = '1'
---
    public function myDesign()
    {
        $model = new IEMCustomizationModel();
        $userId = session()->get('user_id');

        $data['designs'] = $model->where('user_id', $userId)->findAll();