app/Controllers/PaymentController.php

    public function checkout()
    {
        $totalPrice = $this->request->getPost('total_price');
        $totalQuantity = $this->request->getPost('total_quantity');
        $shippingName = $this->request->getPost('shipping_name');
        $shippingAddress = $this->request->getPost('shipping_address');

        if (!$totalPrice || $totalQuantity == 0) {
            return redirect()->to('/cart')->with('error', 'Your cart is empty.');
        }

        $orderModel = new OrderModel();
        $orderData = [
            'user_id'        => session()->get('user_id'),
            'product_id'     => 0,
            'order_status'   => 'pending',
            'quantity'       => $totalQuantity,
            'price'          => $totalPrice,
            'payment_method' => 'PayMongo',
            'delivery_date'  => null,
            'date_completed' => null,
            'date_returned'  => null,
            'date_cancelled' => null,
            'created_at'     => date('Y-m-d H:i:s'),
            'shipping_name'    => $shippingName,
            'shipping_address' => $shippingAddress
        ];

        $orderId = $orderModel->insert($orderData, true);
---
INSERT INTO `orders` (`user_id`, `product_id`, `order_status`, `quantity`, `price`, `payment_method`, `delivery_date`, `date_completed`, `date_returned`, `date_cancelled`, `created_at`, `shipping_name`, `shipping_address`) VALUES ('1', 0, 'pending', '1', '8650', 'PayMongo', NULL, NULL, NULL, NULL, '2025-03-24 19:56:20', 'sdf', 'sdf')