app/Controllers/UserController.php

UPDATE `user_accounts` SET `remember_token` = NULL
WHERE `user_accounts`.`user_id` IN ('1')
---
    public function logout(){
        $this->load->requireMethod('userAccount');
        helper('cookie');

        $user_id = $this->load->session->get('user_id');
        if($user_id) {
            $this->load->userAccount->update($user_id, ['remember_token' => null]);

SELECT *
FROM `orders`
WHERE `user_id` = '1'
---
    public function getOrders() {
        $userId = session()->get('user_id');
        $orderModel = new OrderModel();
        $orders = $orderModel->where('user_id', $userId)->findAll();