app/Models/Category_Model.php

SELECT *
FROM `category`
---
    public function getAll()
    {
        return $this->findAll();