app/Models/CommentModel.php

SELECT *
FROM `comments`
WHERE `post_id` = '6'
ORDER BY `created_at` DESC
---
    public function getCommentsByPostId($post_id)
    {
        return $this->where('post_id', $post_id)->orderBy('created_at', 'DESC')->findAll();