app/Models/Gear_Product_Model.php

SELECT *
FROM `products`
ORDER BY `product_id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `products`
---
    public function getAllPaginated($perPage) {
        return $this->orderBy('product_id', 'DESC')->paginate($perPage, 'gears');

SELECT *
FROM `products`
---
    public function getAll() {
        return $this->findAll();