app/Models/LibraryModel.php

SELECT *
FROM `category`
---
    public function getCategories()
    {
        return $this->db->table('category')->get()->getResultArray();

SELECT *
FROM `category`
WHERE `category_id` = '1'
---
    public function getCategoryById($category_id)
    {
        return $this->db->table('category')->where('category_id', $category_id)->get()->getRowArray();