app/Models/OrderModel.php

    public function getUserOrdersByStatus($userId, $status)
    {
        $db = \Config\Database::connect();

        // Get regular product orders with this status
        $regularOrdersBuilder = $db->table('orders');
        $regularOrdersBuilder->select('orders.*, products.product_name, products.image_url');
        $regularOrdersBuilder->join('products', 'products.product_id = orders.product_id', 'left');
        $regularOrdersBuilder->where('orders.user_id', $userId);
        $regularOrdersBuilder->where('orders.order_status', $status);
        $regularOrdersBuilder->where('orders.is_custom_iem', 0);
        $regularOrdersBuilder->orderBy('orders.created_at', 'DESC');
        $regularOrders = $regularOrdersBuilder->get()->getResultArray();

        // Get custom IEM orders with this status
        $customIEMOrdersBuilder = $db->table('orders');
        $customIEMOrdersBuilder->select('orders.*, iem_customizations.design_name as product_name, "Custom IEM" as series, iem_customizations.category');
        $customIEMOrdersBuilder->join('iem_customizations', 'iem_customizations.id = orders.product_id', 'left');
        $customIEMOrdersBuilder->where('orders.user_id', $userId);
        $customIEMOrdersBuilder->where('orders.order_status', $status);
        $customIEMOrdersBuilder->where('orders.is_custom_iem', 1);
        $customIEMOrdersBuilder->orderBy('orders.created_at', 'DESC');
        $customIEMOrders = $customIEMOrdersBuilder->get()->getResultArray();
---
SELECT `orders`.*, `products`.`product_name`, `products`.`image_url`
FROM `orders`
LEFT JOIN `products` ON `products`.`product_id` = `orders`.`product_id`
WHERE `orders`.`user_id` = '1'
AND `orders`.`order_status` = 'shipped'
AND `orders`.`is_custom_iem` = 0
ORDER BY `orders`.`created_at` DESC
SELECT `orders`.*, `iem_customizations`.`design_name` as `product_name`, "Custom IEM" as `series`, `iem_customizations`.`category`
FROM `orders`
LEFT JOIN `iem_customizations` ON `iem_customizations`.`id` = `orders`.`product_id`
WHERE `orders`.`user_id` = '1'
AND `orders`.`order_status` = 'shipped'
AND `orders`.`is_custom_iem` = 1
ORDER BY `orders`.`created_at` DESC