app/Models/OrderModel.php

    public function getTotalOrders()
    {
        return $this->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `orders`

    public function getTotalConfirmed()
    {
        return $this->where('order_status', 'confirmed')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `order_status` = 'confirmed'

    public function getTotalCancelled()
    {
        return $this->where('order_status', 'cancelled')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `order_status` = 'cancelled'

    public function getTotalComplete()
    {
        return $this->where('order_status', 'completed')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `order_status` = 'completed'

    public function getTotalRevenue() {
        return $this->select('SUM(quantity * price) AS totalRevenue')
                    ->where('order_status', 'completed')
                    ->get()
                    ->getRow()
                    ->totalRevenue ?? 0;
---
SELECT SUM(quantity * price) AS totalRevenue
FROM `orders`
WHERE `order_status` = 'completed'