app/Models/Placed_Orders_Model.php

SELECT COUNT(`placed_order_id`) AS `placed_order_id`
FROM `placedOrders`
---
    public function getTotalPlaced() {
        return $this->selectCount('placed_order_id')->get()->getRow();