app/Models/User_Account_Model.php

SELECT *
FROM `user_accounts`
WHERE `user_id` = '1'
 LIMIT 1
---
    public function getUser($field, $toGet)
    {
        return $this->where($field, $toGet)->first();